Autodesk.Navisworks.Api.SearchCondition
Defines a Autodesk.Navisworks.Api.ModelItem.PropertyCategories based condition for use in searches. Immutable.

Autodesk.Navisworks.Api.SearchCondition.#ctor(Autodesk.Navisworks.Api.NamedConstant,Autodesk.Navisworks.Api.NamedConstant,Autodesk.Navisworks.Api.SearchConditionOptions,Autodesk.Navisworks.Api.SearchConditionComparison,Autodesk.Navisworks.Api.VariantData)
Create a search condition
categoryCombinedName: Combined name for category to compare against
propertyCombinedName: Combined name for property to compare against
options: Options to use when evaluating condition
comparison: Comparison operator to use when evaluating condition
value: Value to compare against when evaluating condition
Throws System.ArgumentException:
Argument 'categoryCombinedName' has been Disposed
Throws System.ArgumentException:
Argument 'propertyCombinedName' has been Disposed
Throws System.ArgumentNullException:
Argument 'value' is null
Throws System.ArgumentException:
Argument 'value' has been Disposed

Autodesk.Navisworks.Api.SearchCondition.CategoryCombinedName
Combined name for category to compare against
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SearchCondition.CompareWith(Autodesk.Navisworks.Api.SearchConditionComparison,Autodesk.Navisworks.Api.VariantData)
Creates condition that matches if item has property specified by this condition and compares successfully with value
Throws System.InvalidOperationException:
Invalid operation when '!PropertyCombinedName'
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'value' is null
Throws System.ArgumentException:
Argument 'value' has been Disposed

Autodesk.Navisworks.Api.SearchCondition.Comparison
Comparison operator to use when evaluating condition
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SearchCondition.DisplayStringContains(System.String)
Creates condition that matches if item has property specified by this condition and has a DisplayString value that contains specified string
Throws System.InvalidOperationException:
Invalid operation when '!PropertyCombinedName'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SearchCondition.DisplayStringWildcard(System.String)
Creates condition that matches if item has property specified by this condition and has a DisplayString value that matches specified wildcard string
Throws System.InvalidOperationException:
Invalid operation when '!PropertyCombinedName'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SearchCondition.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.SearchCondition.EqualValue(Autodesk.Navisworks.Api.VariantData)
Creates condition that matches if item has property specified by this condition and equal value
Throws System.InvalidOperationException:
Invalid operation when '!PropertyCombinedName'
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'value' is null
Throws System.ArgumentException:
Argument 'value' has been Disposed

Autodesk.Navisworks.Api.SearchCondition.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.SearchCondition.HasCategoryByCombinedName(Autodesk.Navisworks.Api.NamedConstant)
Creates condition that matches if item has category with specified CombinedName
Throws System.ArgumentException:
Argument 'combinedName' has been Disposed
Throws System.ArgumentNullException:
Argument 'combinedName' is null

Autodesk.Navisworks.Api.SearchCondition.HasCategoryByDisplayName(System.String)
Creates condition that matches if item has category with specified DisplayName
Throws System.ArgumentNullException:
Argument 'displayName' is null

Autodesk.Navisworks.Api.SearchCondition.HasCategoryByName(System.String)
Creates condition that matches if item has category with specified Name
Throws System.ArgumentNullException:
Argument 'name' is null

Autodesk.Navisworks.Api.SearchCondition.HasPropertyByCombinedName(Autodesk.Navisworks.Api.NamedConstant,Autodesk.Navisworks.Api.NamedConstant)
Creates condition that matches if item has property in category with specified CombinedNames
Throws System.ArgumentException:
Argument 'categoryCombinedName' has been Disposed
Throws System.ArgumentNullException:
Argument 'categoryCombinedName' is null
Throws System.ArgumentException:
Argument 'propertyCombinedName' has been Disposed
Throws System.ArgumentNullException:
Argument 'propertyCombinedName' is null

Autodesk.Navisworks.Api.SearchCondition.HasPropertyByDisplayName(System.String,System.String)
Creates condition that matches if item has property in category with specified DisplayNames
Throws System.ArgumentNullException:
Argument 'categoryDisplayName' is null
Throws System.ArgumentNullException:
Argument 'propertyDisplayName' is null

Autodesk.Navisworks.Api.SearchCondition.HasPropertyByName(System.String,System.String)
Creates condition that matches if item has property in category with specified Names
Throws System.ArgumentNullException:
Argument 'categoryName' is null
Throws System.ArgumentNullException:
Argument 'propertyName' is null

Autodesk.Navisworks.Api.SearchCondition.IgnoreStringValueAccents
Creates condition that matches if item matches this condition while ignoring accents during string value comparisons
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SearchCondition.IgnoreStringValueCase
Creates condition that matches if item matches this condition while ignoring case during string value comparisons
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SearchCondition.IgnoreStringValueCharWidths
Creates condition that matches if item matches this condition while ignoring character widths during string value comparisons
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SearchCondition.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.SearchCondition.Negate
Creates condition that matches if item does not match this condition
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SearchCondition.Options
Options to use when evaluating condition
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SearchCondition.PropertyCombinedName
Combined name for property to compare against
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SearchCondition.SameType(Autodesk.Navisworks.Api.VariantDataType)
Creates condition that matches if item has property specified by this condition and value of specified type
Throws System.InvalidOperationException:
Invalid operation when '!PropertyCombinedName'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SearchCondition.StartGroup
Creates condition that is same as this condition with Autodesk.Navisworks.Api.SearchConditionOptions.StartGroup option set
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SearchCondition.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.SearchCondition.Value
Value to compare against when evaluating condition
Throws System.ObjectDisposedException:
Object has been Disposed